---
title: hdfs主备切换导致不均衡问题
date: 2026-01-05 15:47:04
tags: [hdfs]
categories:
  - [hdfs]
---

**问题现象**：块均衡过程中发生主备切换，均衡完成后是均衡状态的，但是一段时间后，集群又会变成不均衡的状态。

**问题分析**：

查看datanode的存储大小变化情况如下图所示：

<!--more-->

![主备切换问题](D:\hadoop文档\1. hdfs运维\主备切换问题.png)

从图中可以看出两个明显的异常：

1. 结束均衡后5个dn都处于均衡的状态，但过了2小时后，又变得不均衡了
2. 主备切换后，移出block的datanode的block数没有减少

结合块均衡的流程（副本先复制后删除）和上图的情况，可以推测，**主备切换后的某个机制促使副本删除动作是延后执行的。均衡完毕后执行了副本删除动作，导致了集群的不平衡**。

查看hdfs的相关流程，发现存在postponedMisreplicatedBlocks这个列表，这个列表保存了nn发生主备切换后，所有待删除的副本。**nn发生主备切换后，删除副本的动作不会立刻下发，而是将待删除的副本存到这个列表中。直到这个数据块的所有副本所在的datanode都进行了全量块汇报。**

因此问题的核心原因就是：**主备切换后为了保证数据不丢失，所有删除动作都会推迟到下一次全量块汇报后执行**。

这样问题的现象就得到了解释

1. 触发主备切换动作
2. dn和它的所有副本被设置为stale状态，删除副本动作被放入postponedMisreplicatedBlocks列表中延后处理
3. 等到下一次全量块汇报后，退出stale状态，扫描postponedMisreplicatedBlocks列表进行处理，进行冗余副本的删除
4. 冗余副本删除动作发生在均衡完成之后，导致了集群的不均衡

**postponedMisreplicatedBlocks列表的必要性**？存在如下一种场景：

1. blockA有两个副本，一个在dn1上，一个在dn2上。
2. nn1向dn1下发删除指令，删除dn1上的副本
3. 下发删除指令后，nn发生主备切换，nn2变成active
4. dn1没有进行块汇报，nn2不知道dn1已经删除了副本，下发删除指令，删除了dn2上的副本
5. 此时产生了数据丢失

问题解决：

社区也报告了同样的问题（https://issues.apache.org/jira/browse/HDFS-16423）

他们提供的patch的做法是，判断副本是否处于stale状态，若是则不对这些副本进行迁移。
